docs: mermaid diagram
